% 导数值计算子函数
% 输入导数计算所需数据值，返回计算导数值列向量
function [m,n]=cal(a,b)
% 定义常量(国际单位制)
Ui=900; %冰块密度
Li=3.35*10^5; %冰块融化潜热
Ci=2.1*10^3; %冰块比热容
Uw=1000; %水的密度
Aw=600; %水的导热系数
Cw=4.2*10^3; %水的比热容
Aa=15; %水的对流传热系数
R=0.031; %冰球初始半径
Ti=-10.4; %冰球初始温度
H0=0.26; %容器高度
R0=0.08; %容器底部半径
Ta=25; %空气温度
Vw=17.3*10^-3; %水的初始温度
k1=2*pi*Aa*H0*R0;
k2=pi*R0^2*Aa;
k3=-3.13414*pi*Aw;
k4=0.86586*pi*Aa;
k5=3.13414*pi*Aw;
k6=-4*pi*Ui*Ci*Ti/(3*R);
k7=-4*pi*Ui*Li; %k1~k7为定义的相关化简方程表达式的常数
m=(k1*(Ta-2*a)+k2*(Ta-2*a)+k2*(Ta-a)+k3*b^2*(a-b*Ti/(2*R)))/(Cw*Uw*Vw); %计算dT/dt
n=(k4*b^2*(Ta-b*Ti/(2*R))+k5*b^2*(a-b*Ti/(2*R)))/(k6*b^3+k7*b^2); %计算dr/dt