% 三次样条插值子函数，输入插值点，返回插值点函数值
%本程序中仅选取t=0,152,300,431,576,740,820数据点进行插值
function S=spline3(p)
x=[0,152,300,431,576,740,820];
y=[23.60,23.30,22.98,22.82,22.70,22.58,22.52]; %插值数据点
n=length(x)-1;
A=zeros(4*n,4*n);
B=zeros(4*n,1);
%构造中间点连续条件
for i=1:n-1
    A(i,4*i-3)=x(i+1)^3;
    A(i,4*i-2)=x(i+1)^2;
    A(i,4*i-1)=x(i+1);
    A(i,4*i)=1;
    A(i,4*i+1)=-x(i+1)^3;
    A(i,4*i+2)=-x(i+1)^2;
    A(i,4*i+3)=-x(i+1);
    A(i,4*i+4)=-1;
end
%构造中间点一阶导数连续
for i=n:2*n-2
    A(i,4*(i-n)+1)=3*x(i-n+2)^2;
    A(i,4*(i-n)+2)=2*x(i-n+2);
    A(i,4*(i-n)+3)=1;
    A(i,4*(i-n)+5)=-3*x(i-n+2)^2;
    A(i,4*(i-n)+6)=-2*x(i-n+2);
    A(i,4*(i-n)+7)=-1;
end
%构造中间点二阶导数连续
for i=2*n-1:3*n-3
    A(i,4*(i-2*n)+5)=6*x(i-2*n+3);
    A(i,4*(i-2*n)+6)=2;
    A(i,4*(i-2*n)+9)=-6*x(i-2*n+3);
    A(i,4*(i-2*n)+10)=-2;
end
%构造经过数据点的条件
A(3*n-2,1)=x(1)^3;
A(3*n-2,2)=x(1)^2;
A(3*n-2,3)=x(1);
A(3*n-2,4)=1;
A(4*n-2,4*n-3)=x(n+1)^3;
A(4*n-2,4*n-2)=x(n+1)^2;
A(4*n-2,4*n-1)=x(n+1);
A(4*n-2,4*n)=1;
for i=3*n-1:4*n-3
    A(i,4*i-12*n+9)=x(i-3*n+3)^3;
    A(i,4*i-12*n+10)=x(i-3*n+3)^2;
    A(i,4*i-12*n+11)=x(i-3*n+3);
    A(i,4*i-12*n+12)=1;
end
%%
%构造边界条件一(函数端点一阶导数值假设为0)
A(4*n-1,1)=3*x(1)^2;
A(4*n-1,2)=2*x(1);
A(4*n-1,2)=1;
A(4*n,4*n-3)=3*x(n+1)^2;
A(4*n,4*n-2)=2*x(n+1);
A(4*n,4*n-1)=1;
for i=3*n-2:4*n-2
    B(i)=y(i-3*n+3);
end
m=inv(A)*B;
if p<152
    S(1)=m(1)*p^3+m(2)*p^2+m(3)*p+m(4);
end
if 152<=p&&p<300
    S(1)=m(5)*p^3+m(6)*p^2+m(7)*p+m(8);
end
if 300<=p&&p<431
    S(1)=m(9)*p^3+m(10)*p^2+m(11)*p+m(12);
end
if 431<=p&&p<576
    S(1)=m(13)*p^3+m(14)*p^2+m(15)*p+m(16);
end
if 576<=p&&p<740
    S(1)=m(17)*p^3+m(18)*p^2+m(19)*p+m(20);
end
if 740<=p
    S(1)=m(21)*p^3+m(22)*p^2+m(23)*p+m(24);
end %根据区间选取对应插值函数
%%
%构造边界条件二(自然边界条件)
A(4*n-1,1)=6*x(1);
A(4*n-1,2)=2;
A(4*n,4*n-3)=6*x(n+1);
A(4*n,4*n-2)=2;
for i=3*n-2:4*n-2
    B(i)=y(i-3*n+3);
end
m=inv(A)*B;
if p<152
    S(2)=m(1)*p^3+m(2)*p^2+m(3)*p+m(4);
end
if 152<=p&&p<300
    S(2)=m(5)*p^3+m(6)*p^2+m(7)*p+m(8);
end
if 300<=p&&p<431
    S(2)=m(9)*p^3+m(10)*p^2+m(11)*p+m(12);
end
if 431<=p&&p<576
    S(2)=m(13)*p^3+m(14)*p^2+m(15)*p+m(16);
end
if 576<=p&&p<740
    S(2)=m(17)*p^3+m(18)*p^2+m(19)*p+m(20);
end
if 740<=p
    S(2)=m(21)*p^3+m(22)*p^2+m(23)*p+m(24);
end %根据区间选取对应插值函数
%%
%构造边界条件三(函数具有周期性)
A(4*n-1,1)=6*x(1);
A(4*n-1,2)=2;
A(4*n-1,4*n-3)=-6*x(n+1);
A(4*n-1,4*n-2)=-2;
A(4*n,1)=3*x(1)^2;
A(4*n,2)=2*x(1);
A(4*n,3)=1;
A(4*n,4*n-3)=-3*x(n+1)^2;
A(4*n,4*n-2)=-2*x(n+1);
A(4*n,4*n-1)=-1;
for i=3*n-2:4*n-2
    B(i)=y(i-3*n+3);
end
m=inv(A)*B;
if p<152
    S(3)=m(1)*p^3+m(2)*p^2+m(3)*p+m(4);
end
if 152<=p&&p<300
    S(3)=m(5)*p^3+m(6)*p^2+m(7)*p+m(8);
end
if 300<=p&&p<431
    S(3)=m(9)*p^3+m(10)*p^2+m(11)*p+m(12);
end
if 431<=p&&p<576
    S(3)=m(13)*p^3+m(14)*p^2+m(15)*p+m(16);
end
if 576<=p&&p<740
    S(3)=m(17)*p^3+m(18)*p^2+m(19)*p+m(20);
end
if 740<=p
    S(3)=m(21)*p^3+m(22)*p^2+m(23)*p+m(24);
end %根据区间选取对应插值函数